In [1]:
#import library
import numpy as np
import pandas as pd

In [2]:
d=details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
    'Age' : [23, 21, 22, 21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
d

{'Name': ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
 'Age': [23, 21, 22, 21],
 'University': ['BHU', 'JNU', 'DU', 'BHU']}

In [3]:
#convert it to DataFrame
df=pd.DataFrame(d)
df

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [4]:
df.columns

Index(['Name', 'Age', 'University'], dtype='object')

In [5]:
df.Name

0        Ankit
1    Aishwarya
2      Shaurya
3     Shivangi
Name: Name, dtype: object

In [7]:
pd.DataFrame(df, columns=['Name', 'Age'])

        Name  Age
0      Ankit   23
1  Aishwarya   21
2    Shaurya   22
3   Shivangi   21

In [9]:
pd.DataFrame(df, columns=['Name', 'Age','Address'])

        Name  Age  Address
0      Ankit   23      NaN
1  Aishwarya   21      NaN
2    Shaurya   22      NaN
3   Shivangi   21      NaN

In [11]:
df.tail(2)

       Name  Age University
2   Shaurya   22         DU
3  Shivangi   21        BHU

In [12]:
df.loc[2]

Name          Shaurya
Age                22
University         DU
Name: 2, dtype: object

In [15]:
df['Age']=np.arange(4)
df

        Name  Age University
0      Ankit    0        BHU
1  Aishwarya    1        JNU
2    Shaurya    2         DU
3   Shivangi    3        BHU

In [16]:
#Constructing DataFrame from numpy ndarray
df1=pd.DataFrame(np.array([[1,1,1],[2,2,2],[3,3,3]]),columns=['a','b','c'],index=[1,2,3])
df1

   a  b  c
1  1  1  1
2  2  2  2
3  3  3  3